app/Http/Middleware/TrackVisitor.php

select * from `visitor_logs` where `session_id` = 'HMCarHtn9axVNbg2829DACaqso1KWpC26Q1l7UdD' and `is_online` = 1 limit 1
---
    protected function trackVisitor(Request $request)
    {
        try {
            $sessionId = session()->getId();
            $ipAddress = $request->ip();
            $userId    = Auth::id();

            $visitor = VisitorLog::where('session_id', $sessionId)
                ->where('is_online', true)
                ->first();

insert into `visitor_logs` (`user_id`, `session_id`, `ip_address`, `user_agent`, `device_type`, `browser`, `platform`, `country`, `country_code`, `region`, `city`, `latitude`, `longitude`, `visited_at`, `last_activity_at`, `landing_page`, `current_page`, `is_online`, `status`, `updated_at`, `created_at`) values (57, 'HMCarHtn9axVNbg2829DACaqso1KWpC26Q1l7UdD', '103.121.107.64', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36', 'desktop', 'Chrome', 'Windows', 'Bangladesh', 'BD', 'Dhaka Division', 'Dhaka', 23.7891, 90.4126, '2026-05-14 06:25:03', '2026-05-14 06:25:03', 'https://shopnotour.com/admin', 'https://shopnotour.com/admin', 1, 'active', '2026-05-14 06:25:03', '2026-05-14 06:25:03')
---
    protected function createVisitorLog($request, $sessionId, $ipAddress, $userId)
    {
        $agent = new Agent();
        $agent->setUserAgent($request->userAgent());

        $locationData = $this->getLocationData($ipAddress);
        $deviceType   = $this->getDeviceType($agent);

        return VisitorLog::create([  // ← return যোগ হয়েছে
            'user_id'          => $userId,
            'session_id'       => $sessionId,
            'ip_address'       => $ipAddress,
            'user_agent'       => $request->userAgent(),
            'device_type'      => $deviceType,
            'browser'          => $agent->browser(),
            'platform'         => $agent->platform(),
            'country'          => $locationData['country']      ?? null,
            'country_code'     => $locationData['country_code'] ?? null,
            'region'           => $locationData['region']       ?? null,
            'city'             => $locationData['city']         ?? null,
            'latitude'         => $locationData['latitude']     ?? null,
            'longitude'        => $locationData['longitude']    ?? null,
            'visited_at'       => now(),
            'last_activity_at' => now(),
            'landing_page'     => $request->fullUrl(),
            'current_page'     => $request->fullUrl(),
            'is_online'        => true,
            'status'           => 'active',
        ]);