Modules/Booking/Admin/BookingManagementController.php

    public function index(Request $request)
    {
        $query = Booking::with(['user', 'passengers', 'issuedBy'])
            ->orderBy('created_at', 'desc');

        // status explicitly request এ আছে কিনা check
        $statusRequested = $request->has('status');
        $selectedStatus  = $request->input('status', 'booked');

        if ($statusRequested && $request->filled('status')) {
            // specific status select করা হয়েছে
            $query->where('status', $selectedStatus);
        } elseif ($statusRequested && !$request->filled('status')) {
            // "All" select করা হয়েছে (status= খালি) — cancelled + pnr_pending বাদ
            $selectedStatus = '';
            $query->whereNotIn('status', ['cancelled', 'pnr_pending']);
        } else {
            // কোনো request নেই — default booked
             $query->whereIn('status', ['booked','issue_request']);
        }

        // Date range filter
        $dateColumn = in_array($request->date_column, [
            'booking_date', 'confirmed_at', 'ticket_issued_at', 'booking_cancel_at'
        ]) ? $request->date_column : 'booking_date';

        if ($request->filled('date_from')) {
            $query->whereDate($dateColumn, '>=', $request->date_from);
        }
        if ($request->filled('date_to')) {
            $query->whereDate($dateColumn, '<=', $request->date_to);
---
select * from `users` where `users`.`id` in (57, 135, 154, 330, 450, 820, 1079, 1596, 1991) and `users`.`deleted_at` is null