Modules/User/Admin/MarketingDashboardController.php

select count(*) as aggregate from `users` where `role_id` = 3 and `deleted_at` is null and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `role_id` = 3 and `active_status` = 1 and `deleted_at` is null and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `role_id` = 2 and `deleted_at` is null and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `role_id` = 2 and `active_status` = 1 and `deleted_at` is null and `users`.`deleted_at` is null
select count(*) as aggregate from `credit_transactions` where `type` = 'deposit' and `status` = 'confirmed' and date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
select count(*) as aggregate from `credit_transactions` where `type` = 'deposit' and `status` = 'pending' and date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
select count(*) as aggregate from `credit_transactions` where `type` = 'withdraw' and `status` = 'confirmed' and date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
select count(*) as aggregate from `credit_transactions` where `type` = 'withdraw' and `status` = 'pending' and date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
---
    public function index(Request $request)
    {
        // Default today
        $dateFrom = $request->input('date_from', date('Y-m-d'));
        $dateTo = $request->input('date_to', date('Y-m-d'));

        // Total B2C Users — date filter নেই (সব সময়ের)
        // B2C Customer (role_id = 3)
        $totalB2CUsers = User::where('role_id', 3)->whereNull('deleted_at')->count();
        $loggedInB2CUsers = User::where('role_id', 3)->where('active_status', 1)->whereNull('deleted_at')->count();

// B2B Agent (role_id = 2)
        $totalB2BUsers = User::where('role_id', 2)->whereNull('deleted_at')->count();
        $loggedInB2BUsers = User::where('role_id', 2)->where('active_status', 1)->whereNull('deleted_at')->count();
        // Deposit
        $totalDeposit = DB::table('credit_transactions')
            ->where('type', 'deposit')->where('status', 'confirmed')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)->count();
        $pendingDeposit = DB::table('credit_transactions')
            ->where('type', 'deposit')->where('status', 'pending')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)->count();

// Withdraw
        $totalWithdraw = DB::table('credit_transactions')
            ->where('type', 'withdraw')->where('status', 'confirmed')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)->count();
        $pendingWithdraw = DB::table('credit_transactions')
            ->where('type', 'withdraw')->where('status', 'pending')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)->count();

select count(*) as aggregate from `credit_transactions` where `type` = 'debit' and `status` = 'payment' and date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
select count(*) as aggregate from `search_sessions` where date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
select count(*) as aggregate from `select_sessions` where date(`created_at`) >= '2026-05-16' and date(`created_at`) <= '2026-05-16'
---
        $totalPaymentAmount = Transaction::where('type', 'debit')->where('status', 'payment')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)
            ->sum('amount');
        $totalPaymentCount = DB::table('credit_transactions')
            ->where('type', 'debit')->where('status', 'payment')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)
            ->count();
        // Search Sessions
        $searchCount = DB::table('search_sessions')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)->count();

        // Price Checked
        $priceCheckedCount = DB::table('select_sessions')
            ->whereDate('created_at', '>=', $dateFrom)->whereDate('created_at', '<=', $dateTo)->count();

select
users.id as user_id,
users.first_name,
users.last_name,
users.email,
users.phone,
COUNT(search_sessions.id) as search_count,
MAX(search_sessions.created_at) as last_search_at
from `search_sessions` inner join `users` on `search_sessions`.`user_id` = `users`.`id` where date(`search_sessions`.`created_at`) >= '2026-05-11' and date(`search_sessions`.`created_at`) <= '2026-05-14' group by `users`.`id`, `users`.`first_name`, `users`.`last_name`, `users`.`email`, `users`.`phone` order by `search_count` desc limit 20 offset 0
---
    public function searchSessions(Request $request)
    {
        $dateFrom = $request->input('date_from', date('Y-m-d'));
        $dateTo = $request->input('date_to', date('Y-m-d'));

        $users = DB::table('search_sessions')
            ->join('users', 'search_sessions.user_id', '=', 'users.id')
            ->selectRaw('
                users.id as user_id,
                users.first_name,
                users.last_name,
                users.email,
                users.phone,
                COUNT(search_sessions.id) as search_count,
                MAX(search_sessions.created_at) as last_search_at
            ')
            ->whereDate('search_sessions.created_at', '>=', $dateFrom)
            ->whereDate('search_sessions.created_at', '<=', $dateTo)
            ->groupBy('users.id', 'users.first_name', 'users.last_name', 'users.email', 'users.phone')
            ->orderByDesc('search_count')
            ->paginate(20)
            ->appends(['date_from' => $dateFrom, 'date_to' => $dateTo]);