Modules/User/Admin/UserController.php

    public function index(Request $request)
    {
        $this->checkPermission('user_view');

        // ✅ ajax() এর বদলে এটা use করুন
        if ($request->has('draw')) {

            $username = $request->input('search.value');
            $role     = $request->query('role');

            $query = User::query();

            if (!empty($username)) {
                $query->where(function ($q) use ($username) {
                    $q->where('first_name', 'LIKE', '%' . $username . '%')
                        ->orWhere('last_name',     'LIKE', '%' . $username . '%')
                        ->orWhere('business_name', 'LIKE', '%' . $username . '%')
                        ->orWhere('email',         'LIKE', '%' . $username . '%')
                        ->orWhere('phone',         $username)
                        ->orWhereRaw("CONCAT(first_name,' ',last_name) LIKE ?", ['%' . $username . '%']);
                    if (is_numeric($username)) {
                        $q->orWhere('id', $username);
                    }
                });
            }

            if (!empty($role)) {
                $query->role($role);
            }

            $totalRecords    = User::count();
---
select count(*) as aggregate from `users` where `users`.`deleted_at` is null

                ->take($length)
                ->get();

            $data = $users->map(function ($row) {
                $verified = $row->email_verified_at
                    ? ' <i class="fa fa-check-circle text-success"></i>'
                    : ' <i class="fa fa-info-circle text-warning"></i>';

                $refHtml = $row->reference_id
                    ? '<span class="badge badge-info">' . $row->reference_id . '</span>'
                    : '<span class="badge badge-secondary">Not Set</span>';

                return [
                    'id'         => $row->id,
                    'name'       => '<a href="' . route('user.admin.detail', ['id' => $row->id]) . '">' . e($row->getDisplayName()) . '</a>',
                    'email'      => e($row->email) . $verified,
                    'balance'    => $row->balance,
                    'phone'      => e($row->phone ?? ''),
                    'role'       => $row->role->name ?? '',
                    'created_at' => display_date($row->created_at),
                    'reference'  => $refHtml,
                    'actions'    => $this->buildActionDropdown($row),
                ];
            });
---
select * from `core_roles` where `core_roles`.`id` = 9 limit 1

        }

        // Normal page load
        return view('User::admin.index', [
            'roles' => Role::all(),
            'rows'  => collect(),
        ]);
---
select * from `core_roles`