Modules/User/Admin/VisitorTrackingController.php

select * from `visitor_page_logs` where `visitor_page_logs`.`id` = 'null' limit 1
---
    public function pageExit(Request $request)
    {
        // sendBeacon FormData হিসেবে আসে, JSON না
        $pageLogId = $request->input('page_log_id') ?? session('current_page_log_id');

        if (!$pageLogId) {
            return response()->json(['success' => false]);
        }

        $pageLog = VisitorPageLog::find($pageLogId);

select * from `visitor_logs` where `visitor_logs`.`id` = 48448 limit 1
---
    private function getVisitorLog(Request $request): ?VisitorLog
    {
        $visitorLogId = session('visitor_log_id');

        if ($visitorLogId) {
            $log = VisitorLog::find($visitorLogId);