Modules/User/Traits/HasRoles.php

select * from `core_roles` where `core_roles`.`id` = 1 limit 1
---
    public function scopeRole($query,$role_id){
        if(is_string($role_id)){
            $role = Role::find($role_id);