Modules/User/Models/VisitorLog.php

update `visitor_logs` set `page_views` = `page_views` + 1, `visitor_logs`.`updated_at` = '2026-05-13 19:21:10' where `id` = 48448
update `visitor_logs` set `last_activity_at` = '2026-05-13 19:21:10', `current_page` = 'http://test.shopnotour.com', `visitor_logs`.`updated_at` = '2026-05-13 19:21:10' where `id` = 48448
---
    public function updateActivity($page = null)
    {
        $data = [
            'last_activity_at' => now(),
            'is_online' => true,
        ];

        if ($page) {
            $data['current_page'] = $page;
            $this->increment('page_views');
        }

        $this->update($data);

update `visitor_logs` set `is_online` = 0, `left_at` = last_activity_at, `duration` = TIMESTAMPDIFF(SECOND, visited_at, last_activity_at), `visitor_logs`.`updated_at` = '2026-05-14 07:35:55' where `is_online` = 1 and `last_activity_at` < '2026-05-14 07:30:55'
---
    public static function markInactiveAsOffline()
    {
        return self::where('is_online', true)
            ->where('last_activity_at', '<', now()->subMinutes(5))
            ->update([
                'is_online' => false,
                'left_at' => DB::raw('last_activity_at'),
                'duration' => DB::raw('TIMESTAMPDIFF(SECOND, visited_at, last_activity_at)'),
            ]);