Modules/Booking/Controllers/BookingController.php

select count(distinct `b`.`id`) as aggregate from `bravo_booking_passengers` as `bp` inner join `bravo_bookings` as `b` on `b`.`id` = `bp`.`booking_id` inner join `bravo_booking_routes` as `br` on `br`.`booking_id` = `b`.`id` where UPPER(bp.passport_number) = 'D43564567' and UPPER(bp.first_name) = 'SHOPNO' and UPPER(bp.last_name) = 'TOUR' and `b`.`object_model` = 'flight' and `br`.`carrier_code` = 'SQ' and YEAR(br.departure_at) = 2026 and MONTH(br.departure_at) = 5 and `b`.`status` not in ('cancelled', 'refunded', 'voided')
---
    private function checkDuplicateBooking(array $passengers, array $flightData): array
    {
        $departureDateRaw = $flightData['legs'][0]['departure']['date'] ?? null;
        if (!$departureDateRaw) return [[], false];

        $year  = (int) substr($departureDateRaw, 0, 4);
        $month = (int) substr($departureDateRaw, 5, 2);
        $carrierCode = $flightData['legs'][0]['segments'][0]['carrier'] ?? null;

        $blocked    = [];
        $hasWarning = false;

        foreach ($passengers as $p) {
            $passport  = strtoupper(trim($p['passport_number'] ?? ''));
            $firstName = strtoupper(trim($p['first_name']      ?? ''));
            $lastName  = strtoupper(trim($p['last_name']       ?? ''));

            if (!$passport || !$firstName || !$lastName) continue;

            $count = DB::table('bravo_booking_passengers as bp')
                ->join('bravo_bookings as b',       'b.id',          '=', 'bp.booking_id')
                ->join('bravo_booking_routes as br', 'br.booking_id', '=', 'b.id')
                ->whereRaw('UPPER(bp.passport_number) = ?', [$passport])
                ->whereRaw('UPPER(bp.first_name) = ?',      [$firstName])
                ->whereRaw('UPPER(bp.last_name) = ?',        [$lastName])
                ->where('b.object_model',  'flight')
                ->where('br.carrier_code', $carrierCode)
                ->whereRaw('YEAR(br.departure_at) = ?',  [$year])
                ->whereRaw('MONTH(br.departure_at) = ?', [$month])
                ->whereNotIn('b.status', ['cancelled', 'refunded', 'voided'])
                ->distinct()
                ->count('b.id');

update `bravo_booking_passengers` set `status` = 'cancelled', `bravo_booking_passengers`.`updated_at` = '2026-05-14 07:04:46' where `bravo_booking_passengers`.`booking_id` = 2113 and `bravo_booking_passengers`.`booking_id` is not null and `bravo_booking_passengers`.`deleted_at` is null
---
            ]);

            /* ── 7. Cancel all passengers ────────────────────── */
            $updatedPassengers = $booking->passengers()->update([
                'status' => 'cancelled',
            ]);