Modules/Booking/Controllers/FlightBookingController.php

select * from `countries` order by `name` asc
---
    public function flightCheckout()
    {
        if (!Auth::check()) {
            return redirect()->back()->with('message', 'You need to login first');
        }
//
//        $priceVerified = session('price_verified');
//        return $priceVerified;
        $selectedFlight = session('selected_flight');
        $searchParams = session('flight_search_params');
//return $searchParams;
        $countries = Cache::remember('countries', 60 * 24, fn() =>
        Country::orderBy('name')->get()
        );