Modules/Flight/Service/Sabre/SabreBookingService.php

select * from `bravo_booking_passengers` where `booking_id` = 1988 and `bravo_booking_passengers`.`deleted_at` is null
select * from `bravo_booking_routes` where `booking_id` = 1988 and `bravo_booking_routes`.`deleted_at` is null order by `departure_at` asc
---
    public function createPnr(Booking $booking): array
    {
        try {
            $passengers = BookingPassengers::where('booking_id', $booking->id)->get();
            $routes = BookingRoutes::where('booking_id', $booking->id)
                ->orderBy('departure_at')
                ->get();