Modules/User/Controllers/UserController.php

            $user->trade_license_file_id = $this->saveToMedia($request->file('trade_license_file'), 'agency/trade');
        }

        $user->save();
---
update `users` set `iata_file_id` = 487, `bio` = '', `user_name` = 'shopnotour', `users`.`updated_at` = '2026-05-16 12:23:14' where `id` = 57