Modules/News/ModuleProvider.php

select count(`id`) as aggregate from `core_news` where `status` = 'pending' and `core_news`.`deleted_at` is null
---
    public static function getAdminMenu()
    {
        $count = News::whereStatus('pending')->count('id');