app/Http/Controllers/HomeController.php

    private function getFlightBackgroundImages()
    {
        // "home" category এর published news এর images নিয়ে আসুন
        $homeNews = \Modules\News\Models\News::where('status', 'publish')
            ->whereHas('category', function($q) {
                $q->where('slug', 'home'); // অথবা যে category চান
            })
            ->whereNotNull('image_id')
            ->take(5) // সর্বোচ্চ ৫টা image
            ->pluck('image_id')
            ->toArray();
---
select `image_id` from `core_news` where `status` = 'publish' and exists (select * from `core_news_category` where `core_news`.`cat_id` = `core_news_category`.`id` and `slug` = 'home' and `core_news_category`.`deleted_at` is null) and `image_id` is not null and `core_news`.`deleted_at` is null limit 5