Modules/Flight/Admin/FlightApiController.php

select * from `flight_apis` where `status` = 'active'
---
    public function manage()
    {
        $this->checkPermission('flight_calling_settings');

        $apis = FlightApi::where('status', '=', 'active')->get();