app/Models/Country.php

select `code`, `passport_min`, `passport_max`, `passport_pattern`, `passport_hint` from `countries`
---
    public static function getPassportRulesJson(): string
    {
        return static::select('code', 'passport_min', 'passport_max', 'passport_pattern', 'passport_hint')
            ->get()
            ->keyBy('code')
            ->map(fn($c) => [
                'min'     => $c->passport_min,
                'max'     => $c->passport_max,
                'pattern' => $c->passport_pattern,
                'hint'    => $c->passport_hint,
            ])
            ->toJson();