app/Models/SearchSession.php

insert into `search_sessions` (`user_id`, `session_id`, `data`, `updated_at`, `created_at`) values (57, 'Bazo2d4YNMoD3uH46vQKC4jKHStMpS1kXEcaYwOh', '{\"trip_type\":\"oneway\",\"adults\":\"1\",\"children\":\"0\",\"infants\":\"0\",\"travel_class\":\"ECONOMY\",\"segments\":[{\"from\":\"61\",\"to\":\"5713\",\"departure\":\"2026-05-29\"}]}', '2026-05-16 13:49:19', '2026-05-16 13:49:19')
---
    public static function log(array $data): static
    {
        return static::create([
            'user_id'    => auth()->id() ?? null,
            'session_id' => session()->getId(),
            'data'       => $data,
        ]);