Modules/Media/Models/Banner.php

    public static function getActive()
    {
        return self::where('status', 'active')
            ->orderBy('order', 'asc')
            ->get();
---
select * from `banners` where `status` = 'active' order by `order` asc